tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "shivammathur/php"
brew "arc"
brew "awscli"
brew "bat"
brew "deno"
brew "docker-compose"
brew "gh"
brew "git"
brew "httpie"
brew "openjdk"
brew "openssl@1.1"
brew "p7zip"
brew "pdftk-java"
brew "zsh"
brew "nvm"
brew "medis"
cask "firefox"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "postman"
cask "proxyman"
cask "raycast"
cask "slack"
cask "spotify"
cask "stats"
cask "visual-studio-code"
cask "whatsapp"
vscode "adpyke.vscode-sql-formatter"
vscode "akamud.vscode-theme-onedark"
vscode "alexcvzz.vscode-sqlite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bierner.comment-tagged-templates"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "htmlhint.vscode-htmlhint"
vscode "humao.rest-client"
vscode "jdinhlife.gruvbox"
vscode "kruemelkatze.vscode-dashboard"
vscode "lucas-rds.curl-to-axios"
vscode "meganrogge.template-string-converter"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "narsenico.vscode-progressive-increment"
vscode "oderwat.indent-rainbow"
vscode "patbenatar.advanced-new-file"
vscode "perkovec.emoji"
vscode "sdras.night-owl"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "tyriar.sort-lines"
vscode "viablelab.capitalize"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
